#include<stdio.h>
#include<stdlib.h>
#include<math.h>

// В интернет-магазине могут покупать только зарегистрированные покупатели.
// Каждый покупатель имеет свой уникальный номер (id).
//
// Информацию о каждой покупке в тот же момент записывают в формате:
// timestamp - количество секунд с 00:00 1 января 1970 года;
// id - номер клиента, который совершил покупку;
// recept_id - номер чека этой покупки.
//
// Сколько покупок было сделано в каждую минуту с момента начала работы магазина?
//
// Входные данные
//
// На стандартный поток ввода (с клавиатуры):
// Натуральное число n < 10000 - количество покупок
// Через пробел timestamp id recept_id на одной строке - информация об одной покупке.
// 0 < timestamp ≤ 2*109, 0 < id ≤ 1000, 0 < recept_id ≤ 108.
//
// Выходные данные
//
// Список от первой до последней покупки в формате с шагом 1 минута:
// количество минут с начала работы магазина пробел количество покупок в этот timestamp.
// По одной записи на строку.
// Началом работы магазина считается timestamp первой покупки (время не убывает).
// Магазин работал не более 4 часов.


int main()
{

    return 0;
}
